{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get Connection to neo4j\n",
    "\n",
    "uri = 'bolt://localhost:7687'\n",
    "username = 'neo4j'\n",
    "password = 'graph'\n",
    "\n",
    "neo4j_driver = GraphDatabase.driver(uri, auth=(username,password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# DATA IS LOADED USING neo4j-import\n",
    "\n",
    "#Netflow = \"LOAD CSV WITH HEADERS FROM 'file:///nf_200.csv' AS row MERGE (m:Devices {Name:row.src_device}) MERGE (n:Devices {Name:row.dst_device}) MERGE (m) -[:Netflow { epoch_time:toInteger(row.epoch_time), duration:toInteger(row.duration), protocol:toInteger(row.protocol), src_port:toInteger(row.src_port), dst_port:toInteger(row.dst_port), src_packets:toInteger(row.src_packets), dst_packets:toInteger(row.dst_packets), src_bytes:toInteger(row.src_bytes), dst_bytes:toInteger(row.dst_bytes) }]-> (n)\"\n",
    "\n",
    "#start = time.time()\n",
    "#with neo4j_driver.session() as neo4j_Session:\n",
    "#    neo4j_Session.run(Netflow)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# DATA IS LOADED USING neo4j-import\n",
    "\n",
    "\n",
    "#HostEvents = \"LOAD CSV WITH HEADERS FROM 'file:///1v_200.csv' AS row MERGE (m:Devices {Name:row.log_host}) MERGE (m) -[:HostEvents { epoch_time:toInteger(row.epoch_time),event_id:toInteger(row.event_id),user_name:row.user_name, domain_name:row.domain_name, logon_id: toInteger(row.logon_id), process_name:row.process_name, process_id:toInteger(row.process_id), parent_process_name:row.parent_process_name, parent_process_id:toInteger(row.parent_process_id) }]-> (m)\" \n",
    "                         \n",
    "#start = time.time()\n",
    "#with neo4j_driver.session() as neo4j_Session:\n",
    "#    neo4j_Session.run(HostEvents)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'count(*)': 5210584}]\n"
     ]
    }
   ],
   "source": [
    "Port_Query = \"MATCH (v0:Devices)-[edge:Netflow]->(v1:Devices) WHERE edge.dst_port=135 OR edge.dst_port=445 CREATE (v0)-[e:LMFlow {epoch_time : toInteger(edge.epoch_time), duration : toInteger(edge.duration), protocol : toInteger(edge.protocol), src_port : toInteger(edge.src_port), dst_port : toInteger(edge.dst_port)}]->(v1) RETURN count(*)\"\n",
    "\n",
    "\n",
    "with neo4j_driver.session() as neo4j_Session:\n",
    "    result1 = neo4j_Session.run(Port_Query)\n",
    "\n",
    "print(result1.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290235, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290154, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290140, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290201, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290119, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290160, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290153, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290241, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290256, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290174, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290194, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290188, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290263, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290208, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290146, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290262, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290127, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290234, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290289, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290282, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290242, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290270, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290290, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290195, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290248, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290118, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290182, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290221, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290167, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290134, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290147, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290133, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290166, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290228, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290126, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290250, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290283, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290269, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290276, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290173, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290181, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290215, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290214, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290222, 'hijack1.epoch_time': 7290114}, {'A': <Node id=42573 labels={'Devices'} properties={'src': 'Comp921148'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7290202, 'hijack1.epoch_time': 7290114}, {'A': <Node id=63491 labels={'Devices'} properties={'src': 'Comp452069'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7304934, 'hijack1.epoch_time': 7304755}, {'A': <Node id=63491 labels={'Devices'} properties={'src': 'Comp452069'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7304934, 'hijack1.epoch_time': 7304755}, {'A': <Node id=63491 labels={'Devices'} properties={'src': 'Comp452069'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7304912, 'hijack1.epoch_time': 7304755}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283368, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283398, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283419, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283458, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283509, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283387, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283404, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283488, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283428, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283422, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283378, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283518, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283384, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283367, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283382, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283434, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283524, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283464, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283539, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283482, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283389, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283392, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283452, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283494, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283383, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283392, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283479, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283512, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283542, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283449, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283374, 'hijack1.epoch_time': 7283365}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283548, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283553, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283398, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283419, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283458, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283509, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283387, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283404, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283488, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283428, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283422, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283518, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283384, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283382, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283434, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283524, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283464, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283539, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283554, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283482, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283389, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283392, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283452, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283494, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7283383, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283392, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283479, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283512, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283542, 'hijack1.epoch_time': 7283381}, {'A': <Node id=84362 labels={'Devices'} properties={'src': 'Comp327499'}>, 'B': <Node id=98017 labels={'Devices'} properties={'src': 'Comp337732'}>, 'r1.epoch_time': 7283449, 'hijack1.epoch_time': 7283381}, {'A': <Node id=90004 labels={'Devices'} properties={'src': 'Comp335577'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7308106, 'hijack1.epoch_time': 7307985}, {'A': <Node id=90004 labels={'Devices'} properties={'src': 'Comp335577'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7308105, 'hijack1.epoch_time': 7307985}, {'A': <Node id=90004 labels={'Devices'} properties={'src': 'Comp335577'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7308075, 'hijack1.epoch_time': 7307985}, {'A': <Node id=90004 labels={'Devices'} properties={'src': 'Comp335577'}>, 'B': <Node id=7750 labels={'Devices'} properties={'src': 'Comp829338'}>, 'r1.epoch_time': 7308107, 'hijack1.epoch_time': 7307985}, {'A': <Node id=90004 labels={'Devices'} properties={'src': 'Comp335577'}>, 'B': <Node id=22982 labels={'Devices'} properties={'src': 'Comp056180'}>, 'r1.epoch_time': 7308155, 'hijack1.epoch_time': 7307985}, {'A': <Node id=90004 labels={'Devices'} properties={'src': 'Comp335577'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7308094, 'hijack1.epoch_time': 7307985}, {'A': <Node id=90004 labels={'Devices'} properties={'src': 'Comp335577'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7308096, 'hijack1.epoch_time': 7307985}, {'A': <Node id=90004 labels={'Devices'} properties={'src': 'Comp335577'}>, 'B': <Node id=123314 labels={'Devices'} properties={'src': 'Comp915658'}>, 'r1.epoch_time': 7308107, 'hijack1.epoch_time': 7307985}, {'A': <Node id=90004 labels={'Devices'} properties={'src': 'Comp335577'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7308105, 'hijack1.epoch_time': 7307985}, {'A': <Node id=123817 labels={'Devices'} properties={'src': 'Comp498188'}>, 'B': <Node id=31481 labels={'Devices'} properties={'src': 'ActiveDirectory'}>, 'r1.epoch_time': 7303662, 'hijack1.epoch_time': 7303647}]\n"
     ]
    }
   ],
   "source": [
    "LMflow_Query = \"MATCH (A:Devices)-[r1:LMFlow]->(B:Devices) MATCH (A)-[hijack1:HostEvents]->(A) WHERE A <> B AND hijack1.event_id = 4688 AND hijack1.parent_process_name = 'lsass' AND hijack1.epoch_time <= r1.epoch_time AND r1.epoch_time - hijack1.epoch_time < 180 RETURN A, B, r1.epoch_time, hijack1.epoch_time\"\n",
    "\n",
    "\n",
    "with neo4j_driver.session() as neo4j_Session:\n",
    "    result2 = neo4j_Session.run(LMflow_Query)\n",
    "\n",
    "print(result2.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
